joyceandpig/STM32_USB_MASS/Utilities/stm32_eval/stm32_fsmc_nand.c
/***************************************************************
       
    ? ? ?:NAND FLASH????
    ?    ?:
    ?    ?:
	? ? ?:
    ????:
    ????:  
    ????: KEIL FOR ARM
    ????:  K9F1G08U0A??NAND
    ????: ????,?????
   ?:????????????,??????????????
    
***************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "stm32_fsmc_nand.h"
//#include <stdio.h>

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/

#define FSMC_Bank_NAND     FSMC_Bank2_NAND
#define Bank_NAND_ADDR     Bank2_NAND_ADDR 
#define Bank2_NAND_ADDR    ((u32)0x70000000)

/* Private macro -------------------------------------------------------------*/


/* Private variables ---------------------------------------------------------*/
uint32 FlashCurrentWriteSectorAddr; //????????
uint32 FlashCurrentReadSectorAddr;  //????????
uint32 FlashNeedWriteBack; //???????

uint8 FlashSectorBuf[FLASH_SECTOR_SIZE]; //?????????

uint32 FlashBadBlockTable[2][FLASH_BAD_BLOCKS_REMAP+1]; //?????????
static uint32 FlashBadBlocksCount;  //??????
uint8 FlashRemapBlockStatus[FLASH_BAD_BLOCKS_REMAP+1]; //???????????
static uint32 FlashLastAccessAddr; //??????????
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
/*******************************************************************************
* Function Name  : FSMC_NAND_Init
* Description    : Configures the FSMC and GPIOs to interface with the NAND memory.
*                  This function must be called before any write/read operation
*                  on the NAND.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void FSMC_NAND_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStructure; 
  FSMC_NANDInitTypeDef FSMC_NANDInitStructure;
  FSMC_NAND_PCCARDTimingInitTypeDef  p;
  
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD | RCC_APB2Periph_GPIOE | 
                         RCC_APB2Periph_GPIOF | RCC_APB2Periph_GPIOG, ENABLE);
  
/*-- GPIO Configuration ------------------------------------------------------*/
/* CLE, ALE, D0->D3, NOE, NWE and NCE2  NAND pin configuration  */
  GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_11 | GPIO_Pin_12 | GPIO_Pin_14 | GPIO_Pin_15 |  
                                 GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_4 | GPIO_Pin_5 | 
                                 GPIO_Pin_7;                                  
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;

  GPIO_Init(GPIOD, &GPIO_InitStructure); 

/* D4->D7 NAND pin configuration  */  
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10;

  GPIO_Init(GPIOE, &GPIO_InitStructure);


/* NWAIT NAND pin configuration */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;   							 
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
 // GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;

 // GPIO_Init(GPIOD, &GPIO_InitStructure); 

/* INT2 NAND pin configuration */  
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;   							 
  GPIO_Init(GPIOG, &GPIO_InitStructure);

  /*-- FSMC Configuration ------------------------------------------------------*/
  p.FSMC_SetupTime = 0x1;
  p.FSMC_WaitSetupTime = 0x3;
  p.FSMC_HoldSetupTime = 0x2;
  p.FSMC_HiZSetupTime = 0x1;

  FSMC_NANDInitStructure.FSMC_Bank = FSMC_Bank2_NAND;
  FSMC_NANDInitStructure.FSMC_Waitfeature = FSMC_Waitfeature_Enable;
  FSMC_NANDInitStructure.FSMC_MemoryDataWidth = FSMC_MemoryDataWidth_8b;
  FSMC_NANDInitStructure.FSMC_ECC = FSMC_ECC_Enable;
  FSMC_NANDInitStructure.FSMC_ECCPageSize = FSMC_ECCPageSize_512Bytes;
  FSMC_NANDInitStructure.FSMC_AddressLowMapping = FSMC_AddressLowMapping_Direct;
  FSMC_NANDInitStructure.FSMC_TCLRSetupTime = 0x00;
  FSMC_NANDInitStructure.FSMC_TARSetupTime = 0x00;
  FSMC_NANDInitStructure.FSMC_CommonSpaceTimingStruct = &p;
  FSMC_NANDInitStructure.FSMC_AttributeSpaceTimingStruct = &p;

  FSMC_NANDInit(&FSMC_NANDInitStructure);

  /* FSMC NAND Bank Cmd Test */
  FSMC_NANDCmd(FSMC_Bank2_NAND, ENABLE);
}

/********************************************************************
????:FLASH????
????:Val:???????
?    ?:??
?    ?:
********************************************************************/
void FlashWriteCommand(uint8 Cmd)
{
   *(uint8 *)(Bank_NAND_ADDR | CMD_AREA) = Cmd; 
}
/////////////////////////End of function/////////////////////////////

/********************************************************************
????:FLASH????
????:Data:??????
?    ?:??
?    ?:
********************************************************************/
uint8 FlashReadDataByte()
{
   uint8 Data;
   Data = *(uint8 *)(Bank_NAND_ADDR);
   return  Data;
}

/********************************************************************
????:FLASH????
????:Data:??????
?    ?:??
?    ?:
********************************************************************/
void FlashWriteDataByte(uint8 Data)
{
   *(uint8 *)(Bank_NAND_ADDR | DATA_AREA)=Data;
}
/********************************************************************
????:FLASH????
????:Addr:??????
?    ?:??
?    ?:
********************************************************************/
void FlashWriteAddr(uint8 Addr)
{
	*(uint8 *)(Bank_NAND_ADDR | ADDR_AREA) = Addr;
}

/********************************************************************
????:??FLASH????
????:?
?    ?:??
?    ?:
********************************************************************/
void FlashWait()
{
	while(GPIO_ReadInputDataBit(GPIOG,GPIO_Pin_6) == Bit_RESET);  //?????  ?????
}
/////////////////////////End of function/////////////////////////////
/********************************************************************
????:?FLASH???????????
????:Addr:?????????
?    ?:??
?    ?:
********************************************************************/
void FlashWriteAddr4Byte(uint32 Addr)
{
 uint i;
 
