joyceandpig/STM32_USB_MASS/Utilities/stm32_eval/stm32_fsmc_nand.c
 //??:?FLASH??????5bit???0
 //???16???5?
 Addr=((Addr<<5)&(~0xFFFF))|(Addr&0x07FF);

 for(i=0;i<4;i++) //????????
 {
  FlashWriteAddr(Addr);
  Addr>>=8;
 }

}
/////////////////////////End of function/////////////////////////////
/********************************************************************
????:?FLASH???????????
????:Addr:?????????
?    ?:??
?    ?:
********************************************************************/
void FlashWriteAddr2Byte(uint32 Addr)
{
 uint i;
 
 //????11?
 Addr=Addr&(FLASH_PAGE_SIZE-1);

 for(i=0;i<2;i++)     //????????
 {
  FlashWriteAddr(Addr);
  Addr>>=8;
 }

}
/////////////////////////End of function////////////////////////////

/********************************************************************
????:?FLASH????????????
????:Addr:?????????
?    ?:??
?    ?:
********************************************************************/
void FlashWritePageAddr(uint32 Addr)
{
 uint i;
 
 //?????
 Addr/=FLASH_PAGE_SIZE;

 for(i=0;i<2;i++) //????????
 {
  FlashWriteAddr(Addr); //??????
  Addr>>=8;
 }
}
/////////////////////////End of function////////////

/********************************************************************
????:Flash???
????:??
?    ?:??
?    ?:
********************************************************************/
void FlashReset(void)
{
 FlashWriteCommand(0xFF); //?????
 FlashWait();  //??????
}
/////////////////////////End of function/////////////////////////////

/********************************************************************
????:Flash????
????:??
?    ?:??
?    ?:??
********************************************************************/
void FlashInit(void)
{
 FSMC_NAND_Init();	//FSMC INIT
 FlashReset(); //FLASH??
 FlashCurrentWriteSectorAddr=~0; //?????????????
 FlashCurrentReadSectorAddr=~0;
 FlashNeedWriteBack=0;  //???????
 FlashSwapBlockInit();  //??????
 FlashLoadBadBlockTable(); //?FLASH??????
}

/********************************************************************
????:????????
????:??
?    ?:??
?    ?:FLASH?????
********************************************************************/
uint8 FlashReadStatus(void)
{
 uint8 Status;
 FlashWriteCommand(0x70);  //?????
 Status  = *(uint8 *)(Bank_NAND_ADDR);  //????   
 return Status;
}
/////////////////////////End of function/////////////////////////////

/********************************************************************
????:??????
????:Addr:?????
?    ?:??
?    ?:??
********************************************************************/
uint8 FlashEraseBlock(uint32 Addr)
{
 //??????????
 FlashWriteCommand(0x60);
 //?????????
 FlashWritePageAddr(Addr);
 //??????????
 FlashWriteCommand(0xD0);
 //??????
 FlashWait();
 //??????
 return FlashReadStatus();
}
/////////////////////////End of function/////////////////////////////

/********************************************************************
????:??????????
????:??
?    ?:??
?    ?:??????
********************************************************************/
uint8 FlashWritePage(void)
{
 FlashWriteCommand(0x10);  //????
 FlashWait();  //?????
 return FlashReadStatus();
}
/////////////////////////End of function/////////////////////////////

/********************************************************************
????:???????
????:sAddr:???;dAddr:?????
?    ?:??
?    ?:??????
********************************************************************/
uint8 FlashCopyPage(uint32 sAddr, uint32 dAddr)
{
 //?????????
 FlashWriteCommand(0x00);
 FlashWriteAddr4Byte(sAddr);
 FlashWriteCommand(0x35);
 FlashWait();
 
 //????????
 FlashWriteCommand(0x85);
 FlashWriteAddr4Byte(dAddr);
 FlashWriteCommand(0x10);
 FlashWait();
 return FlashReadStatus();
}
/////////////////////////End of function/////////////////////////////

/********************************************************************
????:????????????
????:??
?    ?:???????
?    ?:?????????,????????????
********************************************************************/
uint32 FlashGetNewRemapBlock(void)
{
 uint32 i,Addr;
 for(i=0;i<FLASH_BAD_BLOCKS_REMAP;i++)
 {
  if(FLASH_BLOCK_OK==FlashRemapBlockStatus[i]) //???????
  {
   Addr=FLASH_BAD_BLOCK_REMAP_ADDR+i*FLASH_BLOCK_SIZE; //????
   if(0x01==(FlashEraseBlock(Addr)&0x01))  //??????
   {
    FlashRemapBlockStatus[i]=FLASH_BLOCK_BAD;  //?????????
   }
   else //??,????
   {
    FlashRemapBlockStatus[i]=FLASH_BLOCK_USED; //?????????    
    return Addr; //????
   }
  }
 }
 return ~0; //?????,???-1?
}
/////////////////////////End of function/////////////////////////////

/********************************************************************
????:?????????????
????:Addr:?????????
?    ?:??
?    ?:??
********************************************************************/
void FlashMarkRemapBlockBad(uint32 Addr)
{
 uint32 i;
 i=(Addr-FLASH_BAD_BLOCK_REMAP_ADDR)/FLASH_BLOCK_SIZE;  //?????
 if(i>=FLASH_BAD_BLOCKS_REMAP)return; //??
 FlashRemapBlockStatus[i]=FLASH_BLOCK_BAD;  //???????
}
/////////////////////////End of function/////////////////////////////

/********************************************************************
????:??????,??????
????:Addr:??????????
?    ?:?????????
?    ?:??
********************************************************************/
uint32 FlashAddrRemap(uint32 Addr)
{
 static uint32 CurrentRemapBlockAddr;
 uint32 i,j;
 
 if(0==FlashBadBlocksCount)  //???????0,??????,??????
 {
  return Addr;
 }
 
 //???????????????????????????,?????????
 if(0==((Addr-FlashLastAccessAddr)&(FLASH_BLOCK_SIZE-1)))
 {
  return CurrentRemapBlockAddr+(Addr&(FLASH_BLOCK_SIZE-1)); //??????????????????
 }
 
 FlashLastAccessAddr=Addr; //????????????
 
 if(1==FlashBadBlocksCount) //???????1,?????
 {
  if((Addr&(~(FLASH_BLOCK_SIZE-1)))==FlashBadBlockTable[0][0]) //???????,?????
  {
   CurrentRemapBlockAddr=FlashBadBlockTable[1][0];
   return CurrentRemapBlockAddr+(Addr&(FLASH_BLOCK_SIZE-1)); //??????????????????
  }
  else //????
  {
   CurrentRemapBlockAddr=Addr&(~(FLASH_BLOCK_SIZE-1));  //???????
   return Addr;  //?????????
  }
 }
 else //??????1
 {
  //?????????????????????????????,
  //?????????,???????
  if((Addr<FlashBadBlockTable[0][0])
   ||((Addr&(FLASH_BLOCK_SIZE-1))>FlashBadBlockTable[0][FlashBadBlocksCount-1]))
  {
   CurrentRemapBlockAddr=Addr&(~(FLASH_BLOCK_SIZE-1));  //???????
   return Addr;  //?????????
  }
  else //??????,???????????????
  {
   i=0;
   j=FlashBadBlocksCount-1;
   while(1)
   {
    if((Addr&(~(FLASH_BLOCK_SIZE-1)))==FlashBadBlockTable[0][(i+j)/2]) //????,???
    {
     CurrentRemapBlockAddr=FlashBadBlockTable[1][(i+j)/2];
     return CurrentRemapBlockAddr+(Addr&(FLASH_BLOCK_SIZE-1)); //??????????????????
    }
    if(i==j)break; //??i?j??,?????
    if((Addr&(~(FLASH_BLOCK_SIZE-1)))<FlashBadBlockTable[0][(i+j)/2])  //????
    {
     j=(i+j)/2-1; //?????
    }
    else //????
    {
     i=(i+j)/2+1; //?????
    }
   }
  }
 }
 //?????????,???????
 CurrentRemapBlockAddr=Addr&(~(FLASH_BLOCK_SIZE-1));  //???????
 return Addr;  //?????????
}
/////////////////////////End of function/////////////////////////////

