joyceandpig/STM32_USB_MASS/Utilities/stm32_eval/stm32_fsmc_nand.c
/********************************************************************
????:?FLASH???????????
????:??
?    ?:??
?    ?:??
********************************************************************/
void FlashLoadBadBlockTable(void)
{
 uint32 i,j,k,Sum,Ok;
 uint8 Data;

 Ok=0; //??????
 for(i=0;i<FLASH_BLOCKS_TABLE;i++) //??????????
 {
  //??????????????,????0xFF,???0xFF,??????????
  FlashWriteCommand(0x00);
  FlashWriteAddr4Byte(FLASH_BLOCK_TABLE_ADDR + FLASH_BLOCK_SIZE*(i+1) - FLASH_PAGE_SIZE);
  FlashWriteCommand(0x30);
  FlashWait(); //??????
  Data = FlashReadDataByte();
  if(Data==0xFF)  //????????????
  {
   //???????????????,????0,???0,???????????
   FlashWriteCommand(0x00);
   FlashWriteAddr4Byte(FLASH_BLOCK_TABLE_ADDR + FLASH_BLOCK_SIZE*(i+1) - 2*FLASH_PAGE_SIZE);
   FlashWriteCommand(0x30);
   FlashWait(); //??????
   Data = FlashReadDataByte();
   if(Data==0) //??????
   {
    Data = FlashReadDataByte(); //?????
    Sum=Data;
    Data = FlashReadDataByte(); //?????
    Sum=(Sum<<8)+Data;
    Data = FlashReadDataByte();//?????
    Sum=(Sum<<8)+Data;
    Data = FlashReadDataByte();//?????
    Sum=(Sum<<8)+Data;
    //????????
    FlashWriteCommand(0x00);
    FlashWriteAddr4Byte(FLASH_BLOCK_TABLE_ADDR + FLASH_BLOCK_SIZE*i);
    FlashWriteCommand(0x30);
    FlashWait(); //??????
    //???1?????0
    Data = FlashReadDataByte();
    if(Data!=0)continue;
    //???2?????0x55
    Data = FlashReadDataByte();
    if(Data!=0x55)continue;
    //???3?????0xAA
    Data = FlashReadDataByte();
    if(Data!=0xAA)continue;
    //???4?????0xFF
    Data = FlashReadDataByte();
    if(Data!=0xFF)continue;
    Sum+=0x1FE;
    
    //?????
    Data = FlashReadDataByte();
    FlashBadBlocksCount=Data;
    Sum+=Data;
    Data = FlashReadDataByte();
    FlashBadBlocksCount=(FlashBadBlocksCount<<8)+Data;
    Sum+=Data;
    Data = FlashReadDataByte();
    FlashBadBlocksCount=(FlashBadBlocksCount<<8)+Data;
    Sum+=Data;
    Data = FlashReadDataByte();
    FlashBadBlocksCount=(FlashBadBlocksCount<<8)+Data;
    Sum+=Data;
    j=8;
    //?????
    for(k=0;k<sizeof(FlashBadBlockTable[0][0])*FLASH_BAD_BLOCKS_REMAP*2;k++)
    {
     if(0==(j&(FLASH_PAGE_SIZE-1))) //??????,????????
     {
      FlashWriteCommand(0x00);
      FlashWriteAddr4Byte(FLASH_BLOCK_TABLE_ADDR + FLASH_BLOCK_SIZE*i+j);
      FlashWriteCommand(0x30);
      FlashWait(); //??????
     }
     Data = FlashReadDataByte();
     Sum+=Data; //????
     ((uint8 *)FlashBadBlockTable)[k]=Data;  //??????????
     j++;
    }
    //??????????
    for(k=0;k<sizeof(FlashRemapBlockStatus[0])*FLASH_BAD_BLOCKS_REMAP;k++)
    {
     if(0==(j&(FLASH_PAGE_SIZE-1))) //??????,????????
     {
      FlashWriteCommand(0x00);
      FlashWriteAddr4Byte(FLASH_BLOCK_TABLE_ADDR + FLASH_BLOCK_SIZE*i+j);
      FlashWriteCommand(0x30);
      FlashWait(); //??????
     }
     Data = FlashReadDataByte();
     Sum+=Data; //????
     ((uint8 *)FlashRemapBlockStatus)[k]=Data;   //??????????????
     j++;
    }
    if(Sum==0) //??????,???????
    {
     Ok=0xFF; //?????
     break;   //?????
    }
   }
  }
 }
 
 if(Ok==0) //?????????????????,??????????
 {
  for(i=0;i<FLASH_BLOCKS_TABLE;i++) //????????
  {
   //??????????????,????0,???0,???????????
   FlashWriteCommand(0x00);
   FlashWriteAddr4Byte(FLASH_BLOCK_TABLE_ADDR + FLASH_BLOCK_SIZE*(i+1) - FLASH_PAGE_SIZE);
   FlashWriteCommand(0x30);
   FlashWait(); //??????
   Data = FlashReadDataByte();
   if(Data==0x00)  //??????????
   {
    //???????????????,????0,???0,???????????
    FlashWriteCommand(0x00);
    FlashWriteAddr4Byte(FLASH_BLOCK_TABLE_ADDR + FLASH_BLOCK_SIZE*(i+1) - 2*FLASH_PAGE_SIZE);
    FlashWriteCommand(0x30);
    FlashWait(); //??????
    Data = FlashReadDataByte();
    if(Data==0) //??????
    {
     Data = FlashReadDataByte(); //?????
     Sum=Data;
     Data = FlashReadDataByte(); //?????
     Sum=(Sum<<8)+Data;
     Data = FlashReadDataByte(); //?????
     Sum=(Sum<<8)+Data;
     Data = FlashReadDataByte(); //?????
     Sum=(Sum<<8)+Data;
     //????????
     FlashWriteCommand(0x00);
     FlashWriteAddr4Byte(FLASH_BLOCK_TABLE_ADDR + FLASH_BLOCK_SIZE*i);
     FlashWriteCommand(0x30);
     FlashWait(); //??????
     //???1?????0
     Data = FlashReadDataByte();
     if(Data!=0)continue;
     //???2?????0x55
     Data = FlashReadDataByte();
     if(Data!=0x55)continue;
     //???3?????0xAA
     Data = FlashReadDataByte();
     if(Data!=0xAA)continue;
     //???4?????0xFF
     Data = FlashReadDataByte();
     if(Data!=0xFF)continue;
     Sum+=0x1FE;
     
     //?????
     Data = FlashReadDataByte();
     FlashBadBlocksCount=Data;
     Sum+=Data;
     Data = FlashReadDataByte();
     FlashBadBlocksCount=(FlashBadBlocksCount<<8)+Data;
     Sum+=Data;
     Data = FlashReadDataByte();
     FlashBadBlocksCount=(FlashBadBlocksCount<<8)+Data;
     Sum+=Data;
     Data = FlashReadDataByte();
     FlashBadBlocksCount=(FlashBadBlocksCount<<8)+Data;
     Sum+=Data;
     j=8;
     //?????
     for(k=0;k<sizeof(FlashBadBlockTable[0][0])*FLASH_BAD_BLOCKS_REMAP*2;k++)
     {
      if(0==(j&(FLASH_PAGE_SIZE-1))) //??????,????????
      {
       FlashWriteCommand(0x00);
       FlashWriteAddr4Byte(FLASH_BLOCK_TABLE_ADDR + FLASH_BLOCK_SIZE*i+j);
       FlashWriteCommand(0x30);
       FlashWait(); //??????
      }
      Data = FlashReadDataByte();
      Sum+=Data; //????
      ((uint8 *)FlashBadBlockTable)[k]=Data;  //??????????
      j++;
     }
     //??????????
     for(k=0;k<sizeof(FlashRemapBlockStatus[0])*FLASH_BAD_BLOCKS_REMAP;k++)
     {
      if(0==(j&(FLASH_PAGE_SIZE-1))) //??????,????????
      {
       FlashWriteCommand(0x00);
       FlashWriteAddr4Byte(FLASH_BLOCK_TABLE_ADDR + FLASH_BLOCK_SIZE*i+j);
       FlashWriteCommand(0x30);
       FlashWait(); //??????
      }
      Data = FlashReadDataByte();
      Sum+=Data; //????
      ((uint8 *)FlashRemapBlockStatus)[k]=Data;   //??????????????
      j++;
     }
     if(Sum==0) //??????,???????
     {
      FlashSaveBadBlockTable(); //?????FLASH?      
      Ok=0xFF; //?????
      break;   //?????
     }
    }
   }
  }
 }
 
 if(Ok==0) //???????,??????????
 {
  FlashBadBlocksCount=0; //??????0
  for(i=0;i<FLASH_BAD_BLOCKS_REMAP;i++)
  {
   //???????????
   FlashRemapBlockStatus[i]=FLASH_BLOCK_OK;
   //?????????-1
   FlashBadBlockTable[0][i]=~0;
   FlashBadBlockTable[1][i]=~0;
  }
  //?????????
  FlashSaveBadBlockTable();
 }
 //??????????????
 FlashLastAccessAddr=~0;
}
/////////////////////////End of function/////////////////////////////

