joyceandpig/STM32_USB_MASS/Utilities/stm32_eval/stm32_fsmc_nand.c
/********************************************************************
????:??????FLASH??????
????:??
?    ?:??
?    ?:??
********************************************************************/
void FlashSaveBadBlockTable(void)
{
 uint32 i,j,k,Sum;
 
 for(i=0;i<FLASH_BLOCKS_TABLE;i++) //???????
 {
  FlashWriteCommand(0x80);
  FlashWriteAddr4Byte(FLASH_BLOCK_TABLE_ADDR + FLASH_BLOCK_SIZE*(i+1) - FLASH_PAGE_SIZE);
  FlashWriteDataByte(0x00);  //????????0,??????
  //?????0xFF
  for(j=1;j<FLASH_PAGE_SIZE;j++)
  {
   FlashWriteDataByte(0xFF);
  }
  FlashWritePage(); //??
 }
 
 for(i=0;i<FLASH_BLOCKS_TABLE;i++) //?????????
 {
  FlashEraseBlock(FLASH_BLOCK_TABLE_ADDR + FLASH_BLOCK_SIZE*i); //????
  FlashWriteCommand(0x80);
  FlashWriteAddr4Byte(FLASH_BLOCK_TABLE_ADDR + FLASH_BLOCK_SIZE*i); //??????????
  FlashWriteDataByte(0x00);  //??1?????0
  FlashWriteDataByte(0x55);  //??2?????0x55
  FlashWriteDataByte(0xAA);  //??3?????0xAA
  FlashWriteDataByte(0xFF);  //??4?????0xFF
  Sum=0x1FE;
  //???????,??????
  FlashWriteDataByte((FlashBadBlocksCount>>24)&0xFF);
  Sum+=(FlashBadBlocksCount>>24)&0xFF;
  FlashWriteDataByte((FlashBadBlocksCount>>16)&0xFF);
  Sum+=(FlashBadBlocksCount>>16)&0xFF;
  FlashWriteDataByte((FlashBadBlocksCount>>8)&0xFF);
  Sum+=(FlashBadBlocksCount>>8)&0xFF;
  FlashWriteDataByte((FlashBadBlocksCount)&0xFF);
  Sum+=(FlashBadBlocksCount)&0xFF;
  j=8; //??8??
  //?????
  for(k=0;k<sizeof(FlashBadBlockTable[0][0])*FLASH_BAD_BLOCKS_REMAP*2;k++)
  {
   if(0==(j&(FLASH_PAGE_SIZE-1))) //??????,????????
   {
    FlashWritePage(); //??
    FlashWriteCommand(0x80);
    FlashWriteAddr4Byte(FLASH_BLOCK_TABLE_ADDR + FLASH_BLOCK_SIZE*i + j);
   }
   Sum+=((uint8 *)FlashBadBlockTable)[k]; //????
   FlashWriteDataByte(((uint8 *)FlashBadBlockTable)[k]);  //????
   j++;
  }
  //??????????
  for(k=0;k<sizeof(FlashRemapBlockStatus[0])*FLASH_BAD_BLOCKS_REMAP;k++)
  {
   if(0==(j&(FLASH_PAGE_SIZE-1))) //??????,????????
   {
    FlashWritePage(); //??
    FlashWriteCommand(0x80);
    FlashWriteAddr4Byte(FLASH_BLOCK_TABLE_ADDR + FLASH_BLOCK_SIZE*i + j);
   }
   Sum+=((uint8 *)FlashRemapBlockStatus)[k]; //????
   FlashWriteDataByte(((uint8 *)FlashRemapBlockStatus)[k]);  //????
   j++;
  }
  for(;0!=(j&(FLASH_PAGE_SIZE-1));j++) //???????0xFF
  {
   FlashWriteDataByte(0xFF);
  }
  FlashWritePage();   //??
  
  //?????????????????????
  FlashWriteCommand(0x80);
  FlashWriteAddr4Byte(FLASH_BLOCK_TABLE_ADDR + FLASH_BLOCK_SIZE*(i+1) - 2*FLASH_PAGE_SIZE);
  FlashWriteDataByte(0x00);  //????????0,??????
  //???????1,????????0
  Sum=(~Sum)+1;
  //????
  FlashWriteDataByte((Sum>>24)&0xFF);
  FlashWriteDataByte((Sum>>16)&0xFF);
  FlashWriteDataByte((Sum>>8)&0xFF);
  FlashWriteDataByte((Sum)&0xFF);
  //?????0xFF
  for(j=5;j<FLASH_PAGE_SIZE;j++)
  {
   FlashWriteDataByte(0xFF);
  }
  FlashWritePage(); //??
 }
}
/////////////////////////End of function/////////////////////////////


/********************************************************************
????:??????
????:OldAddr:???;NewAddr:????????
?    ?:??
?    ?:??
********************************************************************/
void FlashUpdateBadBlockTable(uint32 OldAddr,uint32 NewAddr)
{
 uint32 i,j;
 OldAddr&=~(FLASH_BLOCK_SIZE-1); //?????????
 NewAddr&=~(FLASH_BLOCK_SIZE-1);
 if(OldAddr>FLASH_MAX_SECTOR_ADDR) //??????????????,?????????????????
 {
  //????????????
  for(i=0;i<FlashBadBlocksCount;i++)
  {
   if(OldAddr==FlashBadBlockTable[1][i]) //?????????,?????????
   {
    FlashBadBlockTable[1][i]=NewAddr; //?????????
    //??????????????
    FlashMarkRemapBlockBad(OldAddr);
    break;
   }
  }
 }
 else //??????????????
 {
  //?????????,???????,???,??????
  for(i=0;i<FlashBadBlocksCount;i++) 
  {
   if(OldAddr<FlashBadBlockTable[0][i]) //????????
   {
    break;
   }
  }
  for(j=FlashBadBlocksCount;j>i;j--) //??????????,??????
  {
   FlashBadBlockTable[0][j]=FlashBadBlockTable[0][j-1];
   FlashBadBlockTable[1][j]=FlashBadBlockTable[1][j-1];
  }
  //?????????
  FlashBadBlockTable[0][j]=OldAddr;
  FlashBadBlockTable[1][j]=NewAddr;
  FlashBadBlocksCount++; //????????
 }
 FlashSaveBadBlockTable(); //?????
 //???????????????,?????????????
 FlashLastAccessAddr=~0;
}
/////////////////////////End of function/////////////////////////////

/********************************************************************
????:FLASH?????
????:Addr: ?????
?    ?:??
?    ?:???????
********************************************************************/
uint32 FlashDealBadBlock(uint32 Addr, uint32 Type)
{
 uint32 i;
 uint32 RemapBlockAddr;
 uint32 SwapBlockAddr;
 while(1)
 {
  RemapBlockAddr=FlashGetNewRemapBlock();
  if(RemapBlockAddr==~0)  //???????????????,?????????
  {
   return Addr;
  }
  switch(Type)
  {
   //????????,??????????????
   //?????????????????????,??????
   case 1:
    goto Exit;
//   break;
   
   //?????????,???????????????????????
   case 2:
   //??????????????????
   SwapBlockAddr=FlashGetCurrentSwapBlock();  //???????????
   //?????????
   for(i=0;i<(Addr&(FLASH_BLOCK_SIZE-1))/FLASH_PAGE_SIZE+1;i++)
   {
    if(0x01==(FlashCopyPage(SwapBlockAddr+i*FLASH_PAGE_SIZE,RemapBlockAddr+i*FLASH_PAGE_SIZE)&0x01))
    {
     //??????,????????,??????
     goto BadRemapBlock;
    }
   }
   //????,?????
   goto Exit;
//   break;
   
   //?????????,???????????????????,
   //?????????????????????????????
   //???????????????,?????????????
   case 3:  
   //????????????
   SwapBlockAddr=FlashGetCurrentSwapBlock();  //???????????
   //??????
   for(i=0;i<(Addr&(FLASH_BLOCK_SIZE-1))/FLASH_PAGE_SIZE;i++)
   {
    if(0x01==(FlashCopyPage(SwapBlockAddr+i*FLASH_PAGE_SIZE,RemapBlockAddr+i*FLASH_PAGE_SIZE)&0x01))
    {
     //??????,????????,??????
     goto BadRemapBlock;
    }
   }
   //?????,???????????????
   if(0x01==(FlashCopyPage(Addr,RemapBlockAddr+i*FLASH_PAGE_SIZE)&0x01))
   {
    //??????,????????,??????
    goto BadRemapBlock;
   }   
   //????,?????
   goto Exit;
//   break;
   
   default:
   break;
  }
  BadRemapBlock:
  //?????????,??????????
  FlashMarkRemapBlockBad(RemapBlockAddr);
 }
 Exit:
 //?????
 FlashUpdateBadBlockTable(Addr,RemapBlockAddr);
 return RemapBlockAddr+(Addr&(FLASH_BLOCK_SIZE-1));
}
/////////////////////////End of function/////////////////////////////

