joyceandpig/STM32_USB_MASS/Utilities/stm32_eval/stm32_fsmc_nand.c
/********************************************************************
????:???????????
????:Op:??????
?    ?:?????????????
?    ?:??
********************************************************************/
uint32 FlashManageSwapBlock(uint32 Op)
{
 static uint32 Current;
 static uint8 FlashSwapBlockStatus[FLASH_SWAP_BLOCKS];
 uint32 i;
 
 switch(Op)
 {
  case 0:  //?????1,?????
   Current=0;
   for(i=0;i<FLASH_SWAP_BLOCKS;i++)
   {
    FlashSwapBlockStatus[i]=0; //???????????
   }
  break;
  
  case 1: //?????1,?????????????
   while(1)//????,????????(?)?,???????,
   {
    Current++;
    if(Current>=FLASH_SWAP_BLOCKS)
    {
     Current=0;
    }
    if(FlashSwapBlockStatus[Current]==0)break; //???????0,??????
   }
  break;
  
  case 2: //?????2,???????????
  break;
  
  case 3: //?????3,??????????
   FlashSwapBlockStatus[Current]=FLASH_BLOCK_BAD;
  break;
  
  default:
  break;
 }
 return FLASH_SWAP_BLOCK_ADDR+Current*FLASH_BLOCK_SIZE; //??????????
}
/////////////////////////End of function/////////////////////////////

/********************************************************************
????:?????????????????????,
          ?????Addr????????????????
????:Addr:??????????
?    ?:???????
?    ?:???????????,????,
          ????????????,?????????????
          ???????????????????
********************************************************************/
uint32 FlashCopyBlockToSwap(uint32 Addr)
{
 uint32 SwapAddr;
 uint32 i;
 uint32 BlockStartAddr;
 
 BlockStartAddr=(Addr)&(~(FLASH_BLOCK_SIZE-1));  //???????
 
 while(1)
 {
  SwapAddr=FlashGetNextSwapBlock(); //????????
  if(0x00==(FlashEraseBlock(SwapAddr)&0x01)) //??????
  {
   for(i=0;i<FLASH_BLOCK_SIZE/FLASH_PAGE_SIZE;i++)  //???????????????
   {
    //????
    if(0x01&FlashCopyPage(BlockStartAddr+i*FLASH_PAGE_SIZE,SwapAddr+i*FLASH_PAGE_SIZE))
    {
     //??????,???????????,???????????
     goto BadSwapBlock;
    }
   }
   //??????,????????
   if(0x01==(FlashEraseBlock(BlockStartAddr)&0x01)) //??????
   {
    Addr=FlashDealBadBlock(Addr,1); //??????????
    BlockStartAddr=(Addr)&(~(FLASH_BLOCK_SIZE-1));  //???????
   }
   //???????????????
   for(i=0;i<(Addr-BlockStartAddr)/FLASH_PAGE_SIZE;i++)
   {
    //????
    if(0x01&FlashCopyPage(SwapAddr+i*FLASH_PAGE_SIZE,BlockStartAddr+i*FLASH_PAGE_SIZE))
    {
     //??????,??????
     //??FlashDealBadBlock???????????????,
     //??????????Addr???????????????
     Addr=(FlashDealBadBlock(BlockStartAddr+i*FLASH_PAGE_SIZE,2)&(~(FLASH_BLOCK_SIZE-1)))
         +(Addr&(FLASH_BLOCK_SIZE-1));
     BlockStartAddr=(Addr)&(~(FLASH_BLOCK_SIZE-1));  //???????
    }
   }
   return Addr; //????,??
  }
  else //??,????
  {
   BadSwapBlock:
   //??????????
   FlashMarkBadCurrentSwapBlock();
  }
 }
// return Addr;
}
/////////////////////////End of function/////////////////////////////

/********************************************************************
????:?FLASH??????(FLASH_SECTOR_SIZE??)?
????:Addr: ????;pBuf:????????;Remain:?????????????
?    ?:??????0:????0:???
?    ?:?Remain??0?,?????????????????!
          ????????,???Remain?0,??????
********************************************************************/
uint32 FlashWriteOneSector(uint32 Addr, uint8 * pBuf, uint32 Remain)
{
 uint32 i;
 uint32 SwapPageAddr;
// printf("Addr = 0x%x\r\n",Addr);
// printf("Remain = 0x%x\r\n",Remain);
 
 if(Addr>FLASH_MAX_SECTOR_ADDR)return 1; //????????,???????1,??
 Addr=FlashAddrRemap(Addr); //??????
 if((Addr&(~(FLASH_PAGE_SIZE-1)))!=(FlashCurrentWriteSectorAddr&(~(FLASH_PAGE_SIZE-1)))) //???page
 {
//  printf("??\r\n");
  if(FlashNeedWriteBack) //????????,?????????page??
  {
   if(FlashWritePage()&0x01) //????
   {
    Addr=FlashDealBadBlock(Addr-FLASH_PAGE_SIZE,3)+FLASH_PAGE_SIZE;  //????
   }
  }
  if((Addr&(~(FLASH_BLOCK_SIZE-1)))!=(FlashCurrentWriteSectorAddr&(~(FLASH_BLOCK_SIZE-1))))  //???block,????????,
  {
   //?????,?????????????,?????????????
   //??????????????????,???????????,??????????????
//   printf("??\r\n");
   Addr=FlashCopyBlockToSwap(Addr);
  }
  //????????????
  FlashWriteCommand(0x00);
  FlashWriteAddr4Byte(FlashGetCurrentSwapBlock()+(Addr&(FLASH_BLOCK_SIZE-1)));
  FlashWriteCommand(0x35);
  FlashWait();
  //???
  FlashWriteCommand(0x85);
  FlashWriteAddr4Byte(Addr); //?4????
  for(i=0;i<FLASH_SECTOR_SIZE;i++)
  {
   FlashWriteDataByte(pBuf[i]);
  }
  FlashNeedWriteBack=1; //????
 }

 else  //????????,??????
 {
  //???
//  printf("???\r\n");
  FlashWriteCommand(0x85);
  FlashWriteAddr2Byte(Addr);
  for(i=0;i<FLASH_SECTOR_SIZE;i++)
  {
   FlashWriteDataByte(pBuf[i]);
  }
  FlashNeedWriteBack=1; //????
 }
 FlashCurrentWriteSectorAddr=Addr; //?????? 
 if(Remain==0) //??????0,?????,????
 {
//  printf("??\r\n");
  if(FlashNeedWriteBack) //????????,?????????page??
  {
   if(FlashWritePage()&0x01) //????
   {
    Addr=FlashDealBadBlock(Addr,3);  //????
   }
  }
  //??????
  Remain=(((Addr+FLASH_BLOCK_SIZE)&(~(FLASH_BLOCK_SIZE-1)))-(Addr&(~(FLASH_PAGE_SIZE-1))))/FLASH_PAGE_SIZE-1;
  //?????????????
  SwapPageAddr=FlashGetCurrentSwapBlock()+(Addr&(FLASH_BLOCK_SIZE-1));
  
  for(i=0;i<Remain;i++)  //????????????????????????
  {
   Addr+=FLASH_PAGE_SIZE;   //???????
   SwapPageAddr+=FLASH_PAGE_SIZE;   
   if(0x01==(FlashCopyPage(SwapPageAddr,Addr)&0x01)) //??????
   {
    Addr=FlashDealBadBlock(Addr,2);  //????
   }
  }
  FlashNeedWriteBack=0; //????????
  FlashCurrentWriteSectorAddr=~0;
 }
 return 0;
}
/////////////////////////End of function/////////////////////////////

/********************************************************************
????:?FLASH????????????????
????:Addr: ????;pBuf:????????;Remain:?????????????
?    ?:??????0:????0:???
?    ?:?Remain??0?,??????????????????,???0?,
          ??????????,???????????????????flash????????
********************************************************************/
uint32 FlashReadOneSector(uint32 Addr, uint8  *pBuf, uint32 Remain)
{
 uint32 i;
 if(Addr>FLASH_MAX_SECTOR_ADDR)return 1; //????????,???????1,??
 Addr=FlashAddrRemap(Addr); //??????
 if((Addr&(~(FLASH_PAGE_SIZE-1)))
    !=(FlashCurrentReadSectorAddr&(~(FLASH_PAGE_SIZE-1)))) //???page
 {
  //?????,???????
  FlashWriteCommand(0x00);
  FlashWriteAddr4Byte(Addr);
  FlashWriteCommand(0x30);
  FlashWait(); //??????
 }
 else
 {
  //??????,??????
  FlashWriteCommand(0x05);
  FlashWriteAddr2Byte(Addr);
  FlashWriteCommand(0xE0);
  FlashWait(); //??????
 }
 for(i=0;i<FLASH_SECTOR_SIZE;i++)
 {
   pBuf[i]=FlashReadDataByte();  //??????
 }
 FlashCurrentReadSectorAddr=Addr; //?????????
 if(Remain==0) //???????,????????????????
 {
  FlashCurrentReadSectorAddr=~0;
 }

 return 0;
}
/////////////////////////End of function/////////////////////////////

/********************************************************************
????:?FLASH?ID??
????:Buf:??ID??????
?    ?:??
?    ?:??
********************************************************************/
void FlashReadId(uint8 *Buf)
{
 uint8 i;
 FlashWriteCommand(0x90);
 FlashWriteAddr(0); //???

 for(i=0;i<5;i++)  //?5???ID
 {
  Buf[i]=FlashReadDataByte();
 }
}
/////////////////////////End of function/////////////////////////////



/******************* (C) COPYRIGHT 2008 STMicroelectronics *****END OF FILE****/
